app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @post = Post.find_by(params[:id])